Attribute VB_Name = "TxtBx_vvod_vivod"
Public Sub TxtBx_KeyPrss_otr(TxtBx As TextBox, KAsc, KAsc1 As Integer)
        '!! => для VB вместо MSForms.ReturnInteger просто Integer <=!!'
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''' Проверяет текст при в воде в TxtBox (если должно быть введено отрицательное число) '''
'''                 Используется совместно с модулем Str_conv_Nmb                      '''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'=========================================================================================
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'!!!!     Ограничения при вводе в текстовую строку:         !!!!
'!!!!   разрешается ввод цисел от 0 до9 (KAsc 48 to 57)     !!!!
'!!!! "-" (KAsc=45)если осуществляется ввод первого символа !!!!
'!!!! "." (KAsc=46)если она еще не была введена             !!!!
'!!!! "," (KAsc=44)если она еще не была введена             !!!!
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'=========================================================================================
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'''                                                                     ''''
'!!Вызывать:-> TxtBx_KeyPrss_otr txtbx_peremennaya, KeyAscii, KeyAscii <-!!'
'''                                                                     ''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
    Select Case KAsc
        Case 48 To 57
        Case Is = 45 And Len(TxtBx.Text) = 0
        Case Is = 46 And _
            InStr(1, TxtBx.Text, ".") = 0 And InStr(1, TxtBx.Text, ",") = 0
        Case Is = 44 And _
            InStr(1, TxtBx.Text, ",") = 0 And InStr(1, TxtBx.Text, ".") = 0
        Case 13
            SendKeys "{tab}"
        Case 8
        Case Else
            KAsc1 = 0
    End Select
End Sub
Public Sub TxtBx_KeyPrss_pol(TxtBx As TextBox, KAsc, KAsc1 As Integer)
        '!! => для VB вместо MSForms.ReturnInteger просто Integer <=!!'
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''' Проверяет текст при в воде в TxtBox (если должно быть введено положительное число) '''
'''                 Используется совместно с модулем Str_conv_Nmb                      '''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'=========================================================================================
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'!!!!     Ограничения при вводе в текстовую строку:         !!!!
'!!!!  разрешается ввод цисел от 0 до9 (KAsc 48 to 57)     !!!!
'!!!! "." (KAsc=46)если она еще не была введена             !!!!
'!!!! "," (KAsc=44)если она еще не была введена             !!!!
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'=========================================================================================
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'''                                                                     ''''
'!!Вызывать:-> TxtBx_KeyPrss_pol txtbx_peremennaya, KeyAscii, KeyAscii <-!!'
'''                                                                     ''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
    Select Case KAsc
        Case 48 To 57
        Case Is = 46 And _
            InStr(1, TxtBx.Text, ".") = 0 And InStr(1, TxtBx.Text, ",") = 0
        Case Is = 44 And _
            InStr(1, TxtBx.Text, ",") = 0 And InStr(1, TxtBx.Text, ".") = 0
        Case 13
            SendKeys "{tab}"
        Case 8
        Case Else
            KAsc1 = 0
    End Select
End Sub
Public Sub TxtBx_KeyPrss_Integer(TxtBx As TextBox, KAsc, KAsc1 As Integer)
        '!! => для VB вместо MSForms.ReturnInteger просто Integer <=!!'
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
''' Проверяет текст при в воде в TxtBox (если должно быть введено целое число) '''
'''                 Используется совместно с модулем Str_conv_Nmb                      '''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'=========================================================================================
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'!!!!     Ограничения при вводе в текстовую строку:         !!!!
'!!!!  разрешается ввод цисел от 0 до9 (KAsc 48 to 57)     !!!!
'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
'=========================================================================================
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'''                                                                         ''''
'!!Вызывать:-> TxtBx_KeyPrss_Integer txtbx_peremennaya, KeyAscii, KeyAscii <-!!'
'''                                                                         ''''
''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''
    Select Case KAsc
        Case 48 To 57
        Case 13
            SendKeys "{tab}"
        Case 8
        Case Else
            KAsc1 = 0
    End Select
End Sub
Public Sub Number_to_TxtBx(TxtBx As TextBox, Number)
'''''''''''''''''''''''''''''''''''''''''''''''
''' Заполнение полей ввода при вызове формы '''
'''''''''''''''''''''''''''''''''''''''''''''''
If Number <> 0 Then
    If Number <> 1 And Number <> -1 Then
        Select Case Number
            Case -1 To 0
                If Number < 0 Then TxtBx.Text = "-0" & Str(Abs(Number)) _
                Else TxtBx.Text = "-0" & Right(Str(Abs(Number)), Len(Str(Number)) - 1)
            Case 0 To 1
                If Number < 0 Then TxtBx.Text = "0" & Str(Number) _
                Else TxtBx.Text = "0" & Right(Str(Number), Len(Str(Number)) - 1)
            Case Else: If Number < 0 Then TxtBx.Text = Str(Number) _
                        Else TxtBx.Text = Right(Str(Number), Len(Str(Number)) - 1)
        End Select
    Else: If Number < 0 Then TxtBx.Text = Str(Number) _
            Else TxtBx.Text = Right(Str(Number), Len(Str(Number)) - 1)
    End If
Else: TxtBx.Text = ""
End If
End Sub


